---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableReinforcementRoundingSource
source: html/a252906d-b5b4-0b03-6aa2-e33b811967d1.htm
---
# Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableReinforcementRoundingSource Property

Identifies the source of the rounding settings for this element.

## Syntax (C#)
```csharp
public ReinforcementRoundingSource ApplicableReinforcementRoundingSource { get; }
```

## Remarks
For a Rebar or RebarInSystem element, this could be Rebar, RebarType, or ReinforcementSettings. For a RebarType, this could be RebarType or ReinforcementSettings.